/**
 * 문제 설명
가위는 2 바위는 0 보는 5로 표현합니다. 가위 바위 보를 내는 순서대로 나타낸 문자열 rsp가 매개변수로 주어질 때, rsp에 저장된 가위 바위 보를 모두 이기는 경우를 순서대로 나타낸 문자열을 return하도록 solution 함수를 완성해보세요.

제한사항
0 < rsp의 길이 ≤ 100
rsp와 길이가 같은 문자열을 return 합니다.
rsp는 숫자 0, 2, 5로 이루어져 있습니다.
입출력 예
rsp	result
"2"	"0"
"205"	"052"
입출력 예 설명
입출력 예 #1

"2"는 가위이므로 바위를 나타내는 "0"을 return 합니다.
입출력 예 #2

"205"는 순서대로 가위, 바위, 보이고 이를 모두 이기려면 바위, 보, 가위를 순서대로 내야하므로 “052”를 return합니다.
 */

function solution(rsp) {
  var answer = "";
  for (let i = 0; i <= rsp; i++) {
    if (rsp[i] === "2") {
      answer += "0";
    } else if (rsp[i] === "0") {
      answer += "5";
    } else if (rsp[i] === "5") {
      answer += "2";
    }
  }
  return answer;
}

/**
 * ## 

`for 반복문`을 사용해 반복문을 만들어줍니다.

`if 문`을 사용해 rsp의 i 번째 인덱스가 2일 경우 변수 `answer`에 0을 할당합니다.

위 내용을 2 = 0, 0 = 5, 5 = 2 로 `else if`를 써서 변수 `answer`에 할당한 뒤 값을 리턴합니다.
 */
